### Crear un dataframe a partir de un diccionario

In [1]:
import pandas as pd

In [6]:
diccionario = {
    'nombre': ['Juan', 'Ana', 'Jose', 'Arturo', 'Maria', 'Julio'],
    'edad': [25, 18, 23, 27, 18, 24],
    'ciudad': ['Madrid', 'Barcelona', 'Sevilla', 'Valencia', 'Zaragoza', 'Bilbao']
}

In [7]:
df = pd.DataFrame(diccionario)
df

   nombre  edad     ciudad
0    Juan    25     Madrid
1     Ana    18  Barcelona
2    Jose    23    Sevilla
3  Arturo    27   Valencia
4   Maria    18   Zaragoza
5   Julio    24     Bilbao

### Borrar una columna

In [4]:
df = df.drop('ciudad', axis=1)
df

   nombre  edad
0    Juan    25
1     Ana    18
2    Jose    23
3  Arturo    27
4   Maria    18
5   Julio    24

### Eliminar varias columnas si guardar en el dataframe

In [8]:
df.drop(['edad', 'ciudad'], axis=1)
df

   nombre  edad     ciudad
0    Juan    25     Madrid
1     Ana    18  Barcelona
2    Jose    23    Sevilla
3  Arturo    27   Valencia
4   Maria    18   Zaragoza
5   Julio    24     Bilbao

### Mostrar un ejemplo al azar

In [9]:
df_aleatorio = df.sample(3)
df_aleatorio

  nombre  edad    ciudad
0   Juan    25    Madrid
5  Julio    24    Bilbao
4  Maria    18  Zaragoza

In [10]:
df_aleatorio.sort_index()

  nombre  edad    ciudad
0   Juan    25    Madrid
4  Maria    18  Zaragoza
5  Julio    24    Bilbao

In [11]:
df_aleatorio.sort_index(ascending=False)

  nombre  edad    ciudad
5  Julio    24    Bilbao
4  Maria    18  Zaragoza
0   Juan    25    Madrid

In [12]:
df_aleatorio.sort_values('nombre')

  nombre  edad    ciudad
0   Juan    25    Madrid
5  Julio    24    Bilbao
4  Maria    18  Zaragoza

In [13]:
df_aleatorio.sort_values('nombre', ascending=False)

  nombre  edad    ciudad
4  Maria    18  Zaragoza
5  Julio    24    Bilbao
0   Juan    25    Madrid

### Asignar rango a las entradas

In [14]:
df

   nombre  edad     ciudad
0    Juan    25     Madrid
1     Ana    18  Barcelona
2    Jose    23    Sevilla
3  Arturo    27   Valencia
4   Maria    18   Zaragoza
5   Julio    24     Bilbao

In [15]:
df.rank()

   nombre  edad  ciudad
0     4.0   5.0     3.0
1     1.0   1.5     1.0
2     3.0   3.0     4.0
3     2.0   6.0     5.0
4     6.0   1.5     6.0
5     5.0   4.0     2.0

In [16]:
df.rank(ascending=False)

   nombre  edad  ciudad
0     3.0   2.0     4.0
1     6.0   5.5     6.0
2     4.0   4.0     3.0
3     5.0   1.0     2.0
4     1.0   5.5     1.0
5     2.0   3.0     5.0

In [17]:
df.rank(method='max')

   nombre  edad  ciudad
0     4.0   5.0     3.0
1     1.0   2.0     1.0
2     3.0   3.0     4.0
3     2.0   6.0     5.0
4     6.0   2.0     6.0
5     5.0   4.0     2.0